Кейс 1.  
Какой вариант решения задач ниже (1.1-1.6) вы выберете? Коротко объясните, почему именно такой вариант вы выбрали.  
Вариант решения:  
А) делать вручную, B) использовать программу [1], C) написать скрипт [2].  
Задачи:  
1.1 Обработать один текстовый файл, заменив в нём все слова "ООО Винни Пух" на "АО Пятачок"  
ответ В. произведу замену всех найденных слов на необходимое, можно использовать как блокнот, так и notepad++,  к счастью текстовых редактор очень много, мне нравится Атом, есть возможность установки необходимых плагинов. Ну и подсветка текста, в коде. (как в notepad++)  

1.2 Найти строчки, содержащие слово "interface", среди 10 000 текстовых файлов в одном каталоге  
ответ C. в данном случае  файлов много, и для экономии времени написать скрипт который выполнит проверку каждого файла и выведет нам информацию по поиску в отдельный файл  

1.3 Найти повторяющиеся строки в текстовом файле, содержащем 10 строк вида:  
192.168.0.1  
192.168.1.2  
Ответ А. - проще всего посмотреть самим и найти данные строки.  Для ускорения проверки. Т.к. мы спокойно можем отредактировать 10 строк. Но если в каждых строках по несколько адресов можно запутаться, и в таком случае используем ответ В. и используем программный поиск.  

1.4 Заменить все символы "$" на символ "€" в тексте на 1 страницу А4  
Ответ B. - проще всего использовать ПО, в котором есть функция замены буквы, символа, слова.  

1.5 Посчитать количество файлов в папке  
ответ А. если используем  Windows то через свойства системы можно узнать сколько файлов в папке, иначе провалившись в каталог, можно выделись все файлы, так же будет произведён подсчёт и выведется снизу проводника. Если используем терминал в том же Linux, есть команда ls -l  

1.6 Найти повторяющиеся строки в текстовом файле, содержащем 10 000 строк вида:  
192.168.0.1  
192.168.1.2  
Ответ С. - при использовании большого количества файлов, использовал бы всегда скрипт, т.к. если вручную производить проверку потребуется очень много времени + человеческий фактор, пропустил, не заметил и т.д. Лучше качественно написать код который все выполнит, и выведет всю информацию в отдельный файл.  
*
[1] При выборе варианта В дополнительно укажите, какую программу вы будете использовать: Excel, Notepad или любую другую.  
[2] Скриптом мы называем написание кода или команды с помощью языка программирования (Python) или командной оболочки (Bash, Powershell).  








Кейс 2.
Предположим, что вы не владеете инструментом автоматизации - например, языком программирования. Вам руководитель поставил задачу, которую можно решить как вручную, так и почитав статьи в интернете и написав скрипт по аналогии.
Вопрос: на основании чего вы будете решать - делать эту задачу вручную или попытаться автоматизировать решение задачи? Обоснуйте свой ответ.  

Ответ: посмотрю на масштаб работы, если это будет что то объёмное например, на 100 виртуальных машинах изменить объем дисков, с 200Гб на 300Гб, то в таком случае лучше почитать статьи как написать скрипт который выполнит работу, лучше потратить в данном случае своё время на изучение, чем заниматься заменой вручную.
Либо пример как в прошлом кейсе, есть 10000 файлов, в которых необходимо заменить строки. 
Если же работы не много, 2-5 файла, 5-10 виртуальных машин. Можно и обойтись заменой вручную. Но после этого задаться вопросом, можно же написать скрипт который даже в 10 позициях выполнит что я хочу. Поэтому по-хорошему знать инструмент автоматизации, для экономии времени.

Кейс 3.
Как вы думаете, в чем причина популярности виртуальных серверов последнее время?  

Ответ: их популярность в том что ими просто пользоваться, быстрой работой, они дешевле и имеют безопасность, за что отвечает поставщик услуг. 

В чем преимущество виртуальных серверов перед физическими серверами?  

Ответ: Не нужно под него выделять отдельное помещение, физический сервер необходимо обслуживать, следить за его температурой, температурой помещения, в случае сбоев электричества производить проверку, перенастройку. Виртуальный сервер доступен 24/7, и его обслуживанием занимается компания у которой его приобретаем.
Если же у нас большая компания, то можно уменьшить парк, поставив несколько серверов с большими мощностями на них установить ос, и поставить виртуальные машины, но в таком случае обслуживание на нашей стороне.
  
Какие недостатки есть у виртуальных серверов?  
Ответ: Ограниченные настройки доступ к ядру и файловой системе не получится, скорость работы виртуальный сервер работает чуть медленнее чем выделенный сервер, т.к. определённые ресурсы тратятся на саму виртуализацию. А так же в ресурсах, иногда бывает недостаточно стандартных пакетов с характеристиками 1-2Гб RAM и 10-15Гб физ.памяти, в таком случае потребуется приобретение более дорогого пакета.

Кейс 4.  
Какой из вариантов решения вы выберете для каждой из ситуаций (4.1-4.7)? Коротко объясните, почему вы сделали такой выбор.[1]  
Вариант решения:  
A) Физический сервер, B) виртуальный сервер [2], C) контейнеры [3], D) SaaS [4], E) Прочее (предложите свой вариант).  
Ситуации:  
4.1 Почтовый сервер для небольшой компании из 15 человек без постоянного администратора  
ответ D. однозначно, приобретается по подписке, не требуется тратить много ресурсов на приобретение физ сервера, и тратить средства на  работника который это все настроит.

4.2 Сервер для хранения старых резервных копий  
ответ В. не нужно занимать место в серверной, не нужно обслуживание, в случае необходимости восстановить данные.

4.3 Сервер для тестирования приложений в разных окружениях (версиях ОС, версиях языка программирования, и т.д.)  
ответ А - на нем иметь виртуализацию, и разворачивать необходимы ОС для тестирования.

4.4 Web-сервер для размещения сайта компании  
ответ B. приобретение у поставщика услуг, доступ 24/7

4.5 Старое ПО, работающее только на Windows XP  
ответ А. к сожалению потребуется физ сервер т.к. системами виртуализации система не поддерживается по крайней мере от microsoft рянняя версия windows 7.

4.6 Почтовый сервер в компании из 1500 человек и с собственным ИТ отделом  
ответ D, дешевле и быстрее, чем разрабатывать свой, уже есть готовые решения, и приобретаются по подписке и должно хватать функционала.

4.7 Несколько одинаковых серверов, позволяющих запускать и останавливать экземпляры программ по мере необходимости  
ответ C. с помощью контейнеров можно сделать проверку ПО на различные ошибки. 

**
[1] Если вам не хватает информации для принятия решения - укажите, между какими вариантами выбираете и какая информация и как повлияет на ваш выбор.  
[2] Виртуальный сервер - один из нескольких серверов, запущенных на физическом хосте с помощью гипервизора (например, Ubuntu или Windows Server на гипервизоре VmWare ESXi).  
[3] Контейнеры - это программное обеспечение, которое "упаковывает" приложение в стандартизованные блоки (контейнеры). Каждый контейнер включает все необходимое для работы приложения: библиотеки, системные инструменты, код и среду исполнения. Контейнеры можно быстро развертывать (запускать) и таким образом масштабировать приложение (например, Docker-контейнеры).  
[4] SaaS (Software as a service) - программное обеспечение как услуга (например, почтовый сервис Gmail).  


Кейс 5.  
Как вы думаете, что правильнее мониторить:  
инфраструктуру изнутри (свободное место на диске, загрузку процессора и т.д.)  
или сервисы снаружи (как их видит клиент - например, доступность сайта)?  
Обоснуйте свой выбор.  
Ответ: правильнее мониторить всю свою инфраструктуру включая сервисы изнутри, например тот же сайт изнутри, если это продажи, если данный сайт будет не доступен то наши клиенты могут уйти к другому поставщику, инфраструктуру так же требуется мониторить т.к. есть сервисы которые могут виснуть из за большой нагрузки на тот же процессор, RAM. А в случае заполнения диска может отключится например файловый сервер на котором могут быть важные документы которые срочно необходимы.  

Кейс 6.  
Какое из этих вариантов облачных решений вы бы выбрали под каждую из ситуаций (6.1-6.5)? Обоснуйте свой выбор.  
Вариант решения:  
A) SaaS, B) PaaS, C) IaaS  
Ситуации:  

6.1 Сервер с типовой программой CRM для контроля взаимодействия менеджеров с клиентами  
ответ А: есть уже готовые решения конткертных прикладных функций, для ведения клиентской базы.  


6.2 Почтовый сервер для небольшой компании, которой необходима тонкая настройка антиспам фильтров и антивируса для писем  
ответ А. думаю есть тонкая настройка антиспам фильтров и уже предустановлен антивирус.  


6.3 Веб-сервер для сайта-визитки (одностраничный лендинг) компании  
ответ С. если в компании уже есть сервера в laac, то разумнее там развернуть еще одну виртуальную машину и на ней установить веб сервер.  


6.4 Территориально распределенный между несколькими датацентрами отказоустойчивый кластер почтовых серверов  
ответ В. можно у провайдера уже заказать настроенную платформу под данную задачу.  


6.5 Почтовый сервер для небольшой компании из 15 человек без постоянного администратора  
ответ А.  уже есть готовые решения быстрее и экономичнее приобрести у поставщика данной услуги.  

Кейс 7.  
Нужно ли делать резервное копирование в ситуациях ниже (7.1-7.6)? Коротко объясните, почему вы так решили.  
7.1 Перед внесением изменений в конфигурационный файл на сервере - требуется, из за нового кода может произойти сбой в одном из сервисов.  

7.2 Перед удалением с сервера рабочей папки уволенного сотрудника - не требуется, сотрудник уволился, а все необходимые файлы и коды ввели в облаке.  

7.3 Перед применением обновления на работающее ПО на сервере - требуется, обновление может установится с критическими проблемами после которого может не запуститься ПО или работать не правильно.  

7.4 Перед изменением документа, лежащего в общем доступе, в режиме "только чтение" - не требуется. Т.к. документ и так лежит в режиме только для чтения, его никто не может изменить, если потребуется оригинал можно в любое время его посмотреть.  

7.5 Перед копированием файла из папки проекта на рабочий стол - не требуется. Ничего не может случиться с документом.  

7.6 Перед обновлением операционной системы - требуется, т.к. может после установки обновления, при проверке драйверов быть конфликт, и выдавать ошибки. Либо другие иные проблемы в работе системы.  
