Кейс 1.  
Как вы думаете, какие принципиальные отличия есть между:  
компьютером секретаря  
рабочей станцией для работы с 3d графикой  
файловым сервером  
сервером, выполняющим роль маршрутизатора для выхода в интернет  
Ответ:
Если смотреть на все станции, то между ними есть отличия в виде требуемых минимальных характеристик, например рассмотрим файловый сервер и сервер маршрутизатор, между ними отличия в плане хранения данных, файловому серверу требуется намного больше дисков для хранения, но так же серверу выполняющему роль требуется высокоскоростной сетевой порт, по процессору и оперативной памяти зависит уже от количества обращений к нему, но изначально всегда проводится тестовый запуск, с большими трудозатратами и с высокой мощностью сервера, после чего, выполняется мониторинг системы с реальными пользователями и нагрузкой.
Рассмотрим так же две рабочие станции секретаря и и работы с 3d графикой, секретарю довольно мощный ПК не требуется, достаточно под офисное ПО, работа с 1с, ворд, ексель, пдф. Достаточно i3, 8gb RAM, 120ssd. Если же смотреть на ПК для работы с графикой, там уже большую роль играет видеокарта, больший объем оперативной памяти и производительный ЦП.
Итог, между ними всеми использование разных комплектующих (железок).  

Кейс 2.  
Чем отличаются чипсет и процессор?  
Ответ: самое главное отличие что всю вычислительную работу выполняет процессор, т.е. именно он обрабатывает запросы программ. А чипсет — это набор микросхем который является таким проводником, который помогает периферийным компонентам взаимодействовать с процессором, в том числе и ПО, и Пользователем.  

Кейс 3.  
Какой вариант хранилища вы бы выбрали для задач ниже (3.1-3.5)?  
Вариант хранилища:  
А) SSD [1], B) HDD [2], C) Ленточная библиотека [3], D) Собственный вариант.  
Задачи:  
3.1 Хранилище архива проектов, расположенное на диске с общим доступом, не критично к скорости чтения, большого объёма, должно быть доступно круглосуточно – D) RAID HDD  

3.2 Сервер баз 1С с высокими требованиями по скорости доступа к диску – А) SSD  

3.3 Системный диск (на котором установлена операционная система) рабочей станции, объём небольшой – А) SSD  

3.4 Хранилище ежемесячных резервных копий большого объёма, носители которого должны храниться вне офиса на случай пожара и других непредвиденных ситуаций. Подлежат использованию к крайнем случае – С) Ленточная библиотека  

3.5 Второй диск на рабочей станции, на котором пользователь хранит данные второстепенной важности В) HDD  

Кейс 4.  
Существует ли возможность использовать жёсткий диск Western Digital WD40PURZ в комплекте со старой материнской платой, в которой зашит классический BIOS? Если да, то в каком случае. Если нет, то почему? Есть ли какой-то обходной вариант? Напишите ответ в свободной форме.  
Ответ: Возможность такая есть, но при использовании только как хранилища, но еще зависит от операционной системы, в биосе диск может увидится как 4тб, но в системе мы сможем использовать не более 2тб. Но и требования к такому ПК должно быть установлено минимум 2Гб оперативной памяти. Возможно изначально диск может не видится, в таком случае можно попробовать выставить джампер, у WD два основных профиля это контакты 1 и 2 либо 3 и 4. Что позволяет снизить скорость, и даст возможность работу некоторым контролерам SATA. Но на сегодня у производителей есть ПО, которое пытается задействовать всю память диска, при сканировании он видит диск 4тб, и распределяет его как RAID массив, но данных диск Western Digital WD40PURZ когда его делят на RAID, ведет себя плохо.  

Кейс 5.  
Опишите процесс загрузки компьютера с момента нажатия кнопки включения и до появления рабочего стола. Опишите этот процесс настолько детально, насколько вы это понимаете.  
Ответ: Включение ПК –> Подача питания на его компоненты -> Загрузка BIOS (UEFI) -> Происходит тестирование и инициализация оборудования -> Запуск загрузчика -> Загрузка всех необходимых драйверов -> Загрузка фоновых служб -> Рабочий стол  

Кейс 6.  
Попробуйте узнать IP-адрес вашего компьютера из консоли (командной строки) с помощью команды ipconfig или ifconfig в зависимости от ОС, либо через графический интерфейс. Совпадает ли он с адресом, который видит, например, Яндекс? Как вы думаете, почему?  

Ответ: Если мы используем роутер, то у нас образуется локальная сеть, маршрутизатор получает данные по DHCP от провайдера либо так же может быть и статический ручной ввод данных, получаем маршрут до сети интернет, и роутер предоставляет сеть для своей локальной сети, адрес можно указать свой хоть это будет 192.х.х.х хоть 172.х.х.х либо 10.х.х.х Если мы будем использовать напрямую кабель напрямую в ПК, то мы как раз получим тот же самый адрес который и будет светится в браузере.  

Кейс 7.  
Какой процессор вы выберете - Intel Core i5 9600K или Intel Core i7 7700K? Почему Intel Core i5 9600K или Intel Core i7 7700K? Изменится ли мнение после просмотра этого сравнения? Опишите ход ваших мыслей. Какую материнскую плату вы выберете для выбранного процессора?  
Ответ: Выберу i5 9 поколения, так как уже используются более новые технологии, выберу материнскую плату на Z чипсете, так как имеет функционал разгона всех компонентов включая процессор, оперативную память, и более мощную систему охлаждения чипсета. (если даже не разгонять имеет лучшее охлаждение что добавит большей жизни моим комплектующим)  

